==================
Macro Definitions
==================
.de m2
testing
..

---

(source_file
  (macro_definition
    (request_char)
    (identifier)
    (macro_body (text)
      (end_block))))

==================
Macro Call
==================
.m2
---

(source_file
  (macro_call
    (request_char)
    (identifier)))

==================
Macro Call With Arg
==================
.m2 Arg "this iS a Quoted Argument" "hello world" finally
---

(source_file
  (macro_call
    (request_char)
    (identifier)
    (macro_args
      (macro_arg
        (identifier))
      (macro_arg
        (quoted_arg
         (quote_start)
         (text)
	 (quote_end)))
      (macro_arg
        (quoted_arg
         (quote_start)
	 (text)
	 (quote_end)))
      (macro_arg
        (identifier)))))

==================
Macro Call multiline arg
==================
.m2 Arg "this iS a \
Quoted Argument"
---

(source_file
  (macro_call
    (request_char)
    (identifier)
    (macro_args
      (macro_arg
        (identifier))
      (macro_arg
        (quoted_arg
         (quote_start)
         (text)
	 (line_continuation)
	 (text)
	 (quote_end))))))

==================
Macro Call with nested quote in arg
==================
.m2 Arg "this has a ""Nested Quote"" in it's argument"
---

(source_file
  (macro_call
    (request_char)
    (identifier)
    (macro_args
      (macro_arg
        (identifier))
      (macro_arg
        (quoted_arg
         (quote_start)
         (text)
	 (embedded_quote)
	 (text)
	 (embedded_quote)
	 (text)
	 (quote_end))))))


==================
Basic Text
==================
Hello world what is up?
---

(source_file
  (text))

==================
Multiple Lines Of Text
==================
Hello world what is up?
 What could go wrong?
---

(source_file
  (text)
  (text))

==================
Lines Def And Call
==================
.de M2
hello world
.br
..

.M2
---

(source_file
  (macro_definition
   (request_char)
   (identifier)
   (macro_body
     (text)
     (macro_call (request_char) (identifier))
     (end_block)))
  (macro_call (request_char) (identifier)))
  
==================
Indented Calls
==================
.	de M2
hello world
.  br
..

. M2
---

(source_file
  (macro_definition
   (request_char)
   (identifier)
   (macro_body
     (text)
     (macro_call (request_char) (identifier))
     (end_block)))
  (macro_call (request_char) (identifier)))

==================
Font Set
==================
hello world\fB this is now bold \fP \s-1 smaller \s12 regular
---

(source_file
  (text)
  (escape_seq
    (escape_type
      (set_font)))
  (text)
  (escape_seq
    (escape_type
      (set_font)))
  (text)
  (escape_seq
    (escape_type
     (set_font_size)))
  (text)
  (escape_seq
    (escape_type
     (set_font_size)))
  (text))

==================
Macro Call multiline arg
==================
.m2 Arg "this iS a \
Quoted Argument"
---

(source_file
  (macro_call
    (request_char)
    (identifier)
    (macro_args
      (macro_arg
        (identifier))
      (macro_arg
        (quoted_arg
         (quote_start)
         (text)
	 (line_continuation)
	 (text)
	 (quote_end))))))

==================
Macro Call with nested quote in arg
==================
.m2 Arg "this has a ""Nested Quote"" in it's argument"
---

(source_file
  (macro_call
    (request_char)
    (identifier)
    (macro_args
      (macro_arg
        (identifier))
      (macro_arg
        (quoted_arg
         (quote_start)
         (text)
	 (embedded_quote)
	 (text)
	 (embedded_quote)
	 (text)
	 (quote_end))))))


==================
Basic Text
==================
Hello world what is up?
---

(source_file
  (text))

==================
Multiple Lines Of Text
==================
Hello world what is up?
 What could go wrong?
---

(source_file
  (text)
  (text))

==================
Lines Def And Call
==================
.de M2
hello world
.br
..

.M2
---

(source_file
  (macro_definition
   (request_char)
   (identifier)
   (macro_body
     (text)
     (macro_call (request_char) (identifier))
     (end_block)))
  (macro_call (request_char) (identifier)))
  
==================
Indented Calls
==================
.	de M2
hello world
.  br
..

. M2
---

(source_file
  (macro_definition
   (request_char)
   (identifier)
   (macro_body
     (text)
     (macro_call (request_char) (identifier))
     (end_block)))
  (macro_call (request_char) (identifier)))

==================
Comment
==================
hello world\fB this is now bold \fP \s-1 smaller \s12 regular
---

(source_file
  (text)
  (escape_seq
    (escape_type (set_font)))
  (text)
  (escape_seq
    (escape_type (set_font)))
  (text)
  (escape_seq
    (escape_type (set_font_size)))
  (text)
  (escape_seq
    (escape_type (set_font_size)))
  (text))

==================
Copy Mode For Macros
==================
.de m2
testing l\\$1\" ignored comment
..
---

(source_file
  (macro_definition
    (request_char)
    (identifier)
    (macro_body
      (text)
      (copy_mode_escape)
      (interned_escape
            (escape_seq
              (escape_type
                (comment))))
      (text)
      (end_block))))

